// Рекурсия накапливает вызовы в стеке,
// что при слишком большом количестве 
// вызовов может переполнить стэк


console.log("Промежуточная задача 1")

function recursive(n) {
    console.log(`Помещаем в стек задачу ${n}`);
    // если указать 99999 стек переполнится, приложение рухнет
    if (n >= 4) {
      console.log('Достигли конца');
      return;
    }
    
    recursive(n + 1);
    console.log(`Возвращаем из стека ${n}`);
  }
  
  console.log("Промежуточная задача 2")
  recursive(1);
  console.log("Промежуточная задача 3")