//Проработка асинхронного кода

//1. Синтаксис асинхронных функций
//Асинхронные функции объявляются с помощью ключевого слова async.
//Они могут содержать один или несколько операторов await, которые приостанавливают выполнение функции до завершения асинхронной операции.

//Пример асинхронной функции:


async function fetchData() {
    try {
        //Создаем константу response и присваиваем ей результат вызова fetch
        const response = await fetch ('https://jsonplaceholder.typicode.com/posts/1');
        //Создаем константу data в которой будем хранить результат вызова преобразования ответа в JSON
        const data = await response.json();
        //Возвращаем данные
        return data;
    } catch (error) {
        //Если возникает ошибка, то выводим ее в консоль
        console.error('Ошибка при получении данных:', error);
        //Возвращаем null в случае ошибки
        return null;
    }
}

//Теперь мы можем вызвать эту функцию и получить данные которые можно вывести клиенту
//Вызов асинхронной функции

//Запуск функции и обработка результата
fetchData()
    //then - нужен для того чтобы получить результат выполнения функции
    .then(result => {
        console.log('Полученные данные:', result);
    })
    //catch - нужен для того чтобы получить ошибку
    .catch(error => {
        console.error('Ошибка при выполнении:', error);
    });