// создаем объект
let model = {
    hair: 'black',
    clothes: {
        shirt: {
            color: 'white',
            size: 'M'
        },
    }
}

// создаем новую переменную с сылкой на объект
let model2 = model

// Сравниваем по ссылке
console.log(model === model2) //true

// Переопределяем перемунную model удаляя объект
model = null

// Проверяем наличие удаленного объекта в памяти
console.log(model) // удалили
console.log(model2) // по прежнему существует хотя ссылается на model которую удалили, ссылка не на саму переменную а на объект именно в памяти, следовательно, пока есть хоть 1 связь с объектом в памяти, этот объект так и будет существовать