//Синтаксис while

// while (условие) {
//     // код
// }

//Пример
// Нужно вывести в консоль числа от 0 до 9
const wileLoop = () => {
    let i = 0;            //Создаем переменную счетчик который будет увеличиваться на 1
    while (i < 10) {      //Создаем цикл while
        console.log(i);   //Выводим в консоль значение переменной i
        i++;              //Увеличиваем значение переменной i на 1
    }
}

wileLoop(); //Выводит в консоль числа от 0 до 9

// Пример перебора массива
const array = [1, 2, 3, 4, 5];
let i = 0;
while (i < array.length) {
    console.log(array[i]);
    i++;
}

// Пример перебора с условием
const array2 = [1, 2, 3, 4, 5];
let i2 = 0;
while (i2 < array2.length) {
    if (array2[i2] % 2 === 0) {
        console.log(array2[i2]);
    }
    i2++;
}