// Входящий объект
const toolbox = [
    [ // отдел 1
      [ // коробка 1
        ["молоток", "гвозди"], // пакет 1
        ["отвёртка"] // пакет 2
      ],
      [ // коробка 2
        ["гвозди", "шурупы"] // пакет 1
      ]
    ],
    [ // отдел 2
      [ // коробка 1
        ["молоток", "отвёртка"], // пакет 1
        ["пила"] // пакет 2
      ]
    ]
  ];

//Вывод который нужно получить
console.log(countTools(toolbox)) // → ["молоток: 2", "гвозди: 2", "отвёртка: 2", "шурупы: 1", "пила: 1"]

function countTools (toolbox) {
    //Создаем переменную для хранения
    const totalTools = [];

    for(let i = 0; i < toolbox.length; i++){
        for(let k = 0; k < toolbox[i].length; k++){
            for(let p = 0; p < toolbox[i][k].length; p++){
                for(let h = 0; h < toolbox[i][k][p].length; h++){
                    //Создаю переменную для хранения инструмента
                   let tool = toolbox[i][k][p][h];
                   //Создаю переменную для проверки наличия инструмента
                   let found = false;
                    
                   //Счетчиек проходит по уровню пакета
                   for(let b = 0; b < totalTools.length; b++){
                    //Проверяет наличие инструмента
                    if(totalTools[b].startsWith(tool + ': ')){
                        //Если инструмент найден, то увеличиваем счетчик
                        found = true; //Счетчик нашли
                        //Разделяем строку на элементы
                        let part = totalTools[b].split(': '); // [0]: [1] - делим на элементы строку
                        //Переводим в число второй элемент
                        let count = parseInt(part[1]) //переводим в число втрой элемент
                        //Увеличиваем счетчик
                        count += 1
                        //Создаем новую строку
                        let newStr = `${part[0]}: ${count}`
                        //Заменяем старую строку на новую
                        totalTools[b] = newStr
                    }}
                    //Если инструмент не найден, то добавляем его в массив
                    if(!found){
                        //Добавляем инструмент в массив
                        totalTools.push(`${tool}: 1`)
                    }
                }
            }
        }
    }
    return totalTools
}