// ЗАДАЧА: Реализовать функцию debounce с передачей аргументов
// 
// Debounce откладывает выполнение функции до тех пор, 
// пока не пройдет время delay с момента последнего вызова
// ВАЖНО: Функция должна корректно передавать все аргументы
//
// Что должно происходить:
// 1. Принимает функцию func и задержку delay
// 2. Возвращает новую функцию, которая принимает любые аргументы
// 3. Если новая функция вызывается повторно - таймер сбрасывается
// 4. Исходная функция выполняется с переданными аргументами после паузы в delay миллисекунд

// TODO: Реализуйте функцию debounce здесь
function debounce(func, delay) {
    let timeId
    return function (...args) {
        clearTimeout(timeId)
        timeId = setTimeout(() => func(...args), delay )
   }
}

// Тест для проверки:
function greet(name) {
    console.log(`Привет, ${name}!`);
}

const debouncedGreet = debounce(greet, 1000);

debouncedGreet('Анна'); // ничего не выводит сразу
debouncedGreet('Петр'); // сбрасывает предыдущий вызов
debouncedGreet('Мария'); // через 1 секунду: "Привет, Мария!"