// Отработка работы регулярных выражения

// Методы регулярных выражений

// 1. test() - проверяет, соответствует ли строка регулярному выражению
// 2. exec() - ищет в строке совпадение с регулярным выражением и возвращает результат
// 3. match() - ищет в строке совпадение с регулярным выражением и возвращает результат
// 4. replace() - заменяет в строке совпадение с регулярным выражением на другое значение
// 5. search() - ищет в строке совпадение с регулярным выражением и возвращает индекс первого совпадения
// 6. split() - разбивает строку на массив подстрок, используя регулярное выражение


// Вводная строка которую нужно преобразовать регулярным выражением

const str = '@дом Заметка которую @важная-за_дача @срочно нужно добавить в дела чтобы не @семья @обучение забыть о важном телеграм1: @Fuer_kd21 Телеграм2: @paramout и отправить в @сделка телеграм @gonya и на почту golovnya@mail.ru!'

// Задание:
// - нужно написать функцию которая будет принимать строку и возвращать чистый текст без тегов и отдельно массив тегов

const splitStr = (str) => {
    const contextWords = ['телеграм', 'почту', 'email', 'mail', 'skype', 'telegram']
    const regex = /(?<![\w])@[а-яА-Яa-zA-Z0-9-_]+(?=\s|$|[^\w@])/g
    const regex2 = /\s+/g

    // Получаем все теги
    let allTags = str.match(regex).map(tag => tag.replace('@', '')) || []

    // Оставляем тегикоторые не будут встречаться в контексте определенных слов
    const validTags = allTags.filter(tag => {
        const tagIndex = str.indexOf(`@${tag}`)
        // Получаем контекст тега
        const beforeTag = str.substring(Math.max(0, tagIndex - 20), tagIndex).toLowerCase()
        // Проверяем не встречается ли тег в контексте определенных слов
        return !contextWords.some(word => beforeTag.includes(word))
    })

    // Удаляем теги из текста
    let text = str
    validTags.forEach(tag => {
        text = text.replaceAll(`@${tag}`, '')
    })

    // Удаляем лишние пробелы
    text = text.replace(regex2, ' ').trim()

    // Возвращаем результат
    return { tags: validTags, text }
}

const { tags, text } = splitStr(str)
console.log(tags)
console.log(text)

// Дальше нужно написать функцию которая будет принимать 2 массива. Один массив с сохраненными тегами и второй массив с тегами которые нашили в строке. Нужно добавить в массив с сохраненными тегами только те теги которых еще нет

const saveTags = ['дом', 'ваза', 'книга', 'телефон', 'срочно']












