//Задача 1: Правильное создание класса
// Тема: Создание класса с публичными и приватными полями, конструктором.

// class Карта {
//     пинКод = '0000' // должно быть приватным
//     ТипКарты // неправильное название и нет значения
//     constructor(пин) {
//       пинкод = пин // ошибка: не сохраняет в поле
//   }



//Решение:
class Карта {
    //Добавляю приватное поле
    #пинКод = '0000';
    //Добавляю публичное поле
    типКарты = 'Debit';
    //создаю конструктов в который передаю аргументы и указываю с какими полями эти аркументы будут работать
    constructor (пинКод) {
        this.#пинКод = пинКод;
    }
}

//Проверка:
// Создаю новый объект
let карта = new Карта('1234');
//Проверяю что содержит объект
console.log(карта) // выводит Карта { 'типКарты': 'Debit' }
console.log(карта.типКарты); // 'Debit' - выводит
// console.log(карта.#пинКод); // ОШИБКА (SyntaxError) - выводит

//Вывод: все работает

//Как то хочу переделать