// Нельзя менять переменную до ее объявления let const
/* 
a = 2
let a
console.log(a) // ReferenceError
*/

/* 
// А вот так будет работать
let b
b = 2
console.log(b) // Выведет 2
 */

/////// нельзя обращаться к переменной до ее объявления, только после
/* 
console.log(a) // ReferenceError
let a = 2
 */

/////// функции можно вызывать до их объявления, они поднимаются при компиляции кода
/* 
a('Верх') // запустили до написания самой функции

function a (text) {
    console.log('Вызов:', text,'- Я выполнился')
}

a('Низ') // запустили после, тоже норм
 */

/////// Функция поднимается первой а потом все переменные
/* 
fun1()

let fun

function fun1 () {
    console.log('fun 1')
}

fun = function () {
    console.log('fun 2')
}
 */